import { algoritm } from "./util";

describe("алгоритм строки", () => {
    test("разворачивает четное количество символов", () => {
        expect(algoritm('абвг')).toEqual([['а', 'б', 'в', 'г'], ['г', 'б', 'в', 'а'],  ['г', 'в', 'б', 'а']])
    })
    test("разворачивает нечетное количество символов", () => {
        expect(algoritm('абв')).toEqual([['а', 'б', 'в'], ['в', 'б', 'а'], ['в', 'б', 'а']])
    })
    test("разворачивает 1 символ", () => {
        expect(algoritm('а')).toEqual([['а'], ['а']])
    })
    test("разворачивает пустую строку", () => {
        expect(algoritm('')).toEqual([[]])
    })
})